/* Так же в процессе повторения базовых запросов мы создали таблицу users. Нужно написать запрос, который вставить 10 записей в этой бд. Еще нужно написать запрос, который создаст 10 записей из задания 1.*/
INSERT INTO categories (name, code)
VALUES
('Электроника', 'electronics'),
('Смартфоны', 'smartphones'),
('Ноутбуки', 'laptops'),
('Бытовая техника', 'home_appliances'),
('Одежда', 'clothing'),
('Обувь', 'shoes'),
('Аксессуары', 'accessories'),
('Спорт и фитнес', 'sport_fitness'),
('Красота и здоровье', 'beauty_health'),
('Игры и развлечения', 'games_entertainment');

/*===============================================================================================*/
INSERT INTO users (name, surname, age, password)
VALUES
('Иван', 'Иванов', 25, 'password123'),
('Пётр', 'Петров', 30, 'qwerty2024'),
('Алексей', 'Смирнов', 22, 'alex22pass'),
('Дмитрий', 'Кузнецов', 28, 'dm_pass_88'),
('Сергей', 'Попов', 35, 'serg_secure'),
('Анна', 'Соколова', 24, 'anna_pwd'),
('Мария', 'Ковалева', 27, 'maria123'),
('Елена', 'Морозова', 32, 'elena_pass'),
('Ольга', 'Новикова', 29, 'olga_pwd'),
('Николай', 'Фёдоров', 40, 'nik_fed_40');
